benchmark/results/run-20260429-204419/microservices-u50-concurrent-read-run1-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\Quan Hoang\Downloads\DuAnCntt\benchmark\k6\test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  0m01.0s/2m0s

running (0m02.0s), 50/50 VUs, 36 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m02.0s/2m0s

running (0m03.0s), 50/50 VUs, 82 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m03.0s/2m0s

running (0m04.0s), 50/50 VUs, 120 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m04.0s/2m0s

running (0m05.0s), 50/50 VUs, 166 complete and 0 interrupted iterations
default   [   4% ] 50 VUs  0m05.0s/2m0s

running (0m06.0s), 50/50 VUs, 208 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m06.0s/2m0s

running (0m07.0s), 50/50 VUs, 254 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  0m07.0s/2m0s

running (0m08.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m08.0s/2m0s

running (0m09.0s), 50/50 VUs, 347 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m09.0s/2m0s

running (0m10.0s), 50/50 VUs, 390 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m10.0s/2m0s

running (0m11.0s), 50/50 VUs, 432 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  0m11.0s/2m0s

running (0m12.0s), 50/50 VUs, 474 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m12.0s/2m0s

running (0m13.0s), 50/50 VUs, 516 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  0m13.0s/2m0s

running (0m14.0s), 50/50 VUs, 554 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m14.0s/2m0s

running (0m15.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m15.0s/2m0s

running (0m16.0s), 50/50 VUs, 644 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m16.0s/2m0s

running (0m17.0s), 50/50 VUs, 687 complete and 0 interrupted iterations
default   [  14% ] 50 VUs  0m17.0s/2m0s

running (0m18.0s), 50/50 VUs, 732 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m18.0s/2m0s

running (0m19.0s), 50/50 VUs, 778 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  0m19.0s/2m0s

running (0m20.0s), 50/50 VUs, 821 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m20.0s/2m0s

running (0m21.0s), 50/50 VUs, 867 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m21.0s/2m0s

running (0m22.0s), 50/50 VUs, 913 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m22.0s/2m0s

running (0m23.0s), 50/50 VUs, 958 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  0m23.0s/2m0s

running (0m24.0s), 50/50 VUs, 1003 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m24.0s/2m0s

running (0m25.0s), 50/50 VUs, 1045 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  0m25.0s/2m0s

running (0m26.0s), 50/50 VUs, 1087 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m26.0s/2m0s

running (0m27.0s), 50/50 VUs, 1132 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m27.0s/2m0s

running (0m28.0s), 50/50 VUs, 1178 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  0m28.0s/2m0s

running (0m29.0s), 50/50 VUs, 1221 complete and 0 interrupted iterations
default   [  24% ] 50 VUs  0m29.0s/2m0s

running (0m30.0s), 50/50 VUs, 1267 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  0m30.0s/2m0s

running (0m31.0s), 50/50 VUs, 1313 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  0m31.0s/2m0s

running (0m32.0s), 50/50 VUs, 1359 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m32.0s/2m0s

running (0m33.0s), 50/50 VUs, 1403 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m33.0s/2m0s

running (0m34.0s), 50/50 VUs, 1445 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  0m34.0s/2m0s

running (0m35.0s), 50/50 VUs, 1488 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  0m35.0s/2m0s

running (0m36.0s), 50/50 VUs, 1533 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  0m36.0s/2m0s

running (0m37.0s), 50/50 VUs, 1576 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  0m37.0s/2m0s

running (0m38.0s), 50/50 VUs, 1622 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m38.0s/2m0s

running (0m39.0s), 50/50 VUs, 1666 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m39.0s/2m0s

running (0m40.0s), 50/50 VUs, 1713 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  0m40.0s/2m0s

running (0m41.0s), 50/50 VUs, 1758 complete and 0 interrupted iterations
default   [  34% ] 50 VUs  0m41.0s/2m0s

running (0m42.0s), 50/50 VUs, 1803 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  0m42.0s/2m0s

running (0m43.0s), 50/50 VUs, 1850 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  0m43.0s/2m0s

running (0m44.0s), 50/50 VUs, 1892 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m44.0s/2m0s

running (0m45.0s), 50/50 VUs, 1938 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m45.0s/2m0s

running (0m46.0s), 50/50 VUs, 1980 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  0m46.0s/2m0s

running (0m47.0s), 50/50 VUs, 2022 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  0m47.0s/2m0s

running (0m48.0s), 50/50 VUs, 2065 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  0m48.0s/2m0s

running (0m49.0s), 50/50 VUs, 2114 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  0m49.0s/2m0s

running (0m50.0s), 50/50 VUs, 2158 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m50.0s/2m0s

running (0m51.0s), 50/50 VUs, 2200 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m51.0s/2m0s

running (0m52.0s), 50/50 VUs, 2242 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  0m52.0s/2m0s

running (0m53.0s), 50/50 VUs, 2280 complete and 0 interrupted iterations
default   [  44% ] 50 VUs  0m53.0s/2m0s

running (0m54.0s), 50/50 VUs, 2326 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  0m54.0s/2m0s

running (0m55.0s), 50/50 VUs, 2368 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  0m55.0s/2m0s

running (0m56.0s), 50/50 VUs, 2414 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m56.0s/2m0s

running (0m57.0s), 50/50 VUs, 2462 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m57.0s/2m0s

running (0m58.0s), 50/50 VUs, 2502 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  0m58.0s/2m0s

running (0m59.0s), 50/50 VUs, 2542 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  0m59.0s/2m0s

running (1m00.0s), 50/50 VUs, 2584 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  1m00.0s/2m0s

running (1m01.0s), 50/50 VUs, 2626 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  1m01.0s/2m0s

running (1m02.0s), 50/50 VUs, 2672 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  1m02.0s/2m0s

running (1m03.0s), 50/50 VUs, 2714 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  1m03.0s/2m0s

running (1m04.0s), 50/50 VUs, 2764 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  1m04.0s/2m0s

running (1m05.0s), 50/50 VUs, 2808 complete and 0 interrupted iterations
default   [  54% ] 50 VUs  1m05.0s/2m0s

running (1m06.0s), 50/50 VUs, 2848 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  1m06.0s/2m0s

running (1m07.0s), 50/50 VUs, 2892 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  1m07.0s/2m0s

running (1m08.0s), 50/50 VUs, 2934 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  1m08.0s/2m0s

running (1m09.0s), 50/50 VUs, 2976 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  1m09.0s/2m0s

running (1m10.0s), 50/50 VUs, 3018 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  1m10.0s/2m0s

running (1m11.0s), 50/50 VUs, 3064 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  1m11.0s/2m0s

running (1m12.0s), 50/50 VUs, 3110 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  1m12.0s/2m0s

running (1m13.0s), 50/50 VUs, 3154 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  1m13.0s/2m0s

running (1m14.0s), 50/50 VUs, 3196 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  1m14.0s/2m0s

running (1m15.0s), 50/50 VUs, 3238 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  1m15.0s/2m0s

running (1m16.0s), 50/50 VUs, 3280 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  1m16.0s/2m0s

running (1m17.0s), 50/50 VUs, 3322 complete and 0 interrupted iterations
default   [  64% ] 50 VUs  1m17.0s/2m0s

running (1m18.0s), 50/50 VUs, 3368 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  1m18.0s/2m0s

running (1m19.0s), 50/50 VUs, 3414 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  1m19.0s/2m0s

running (1m20.0s), 50/50 VUs, 3460 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  1m20.0s/2m0s

running (1m21.0s), 50/50 VUs, 3504 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  1m21.0s/2m0s

running (1m22.0s), 50/50 VUs, 3546 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  1m22.0s/2m0s

running (1m23.0s), 50/50 VUs, 3588 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  1m23.0s/2m0s

running (1m24.0s), 50/50 VUs, 3627 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  1m24.0s/2m0s

running (1m25.0s), 50/50 VUs, 3672 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  1m25.0s/2m0s

running (1m26.0s), 50/50 VUs, 3714 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  1m26.0s/2m0s

running (1m27.0s), 50/50 VUs, 3763 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  1m27.0s/2m0s

running (1m28.0s), 50/50 VUs, 3808 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  1m28.0s/2m0s

running (1m29.0s), 50/50 VUs, 3851 complete and 0 interrupted iterations
default   [  74% ] 50 VUs  1m29.0s/2m0s

running (1m30.0s), 50/50 VUs, 3896 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  1m30.0s/2m0s

running (1m31.0s), 50/50 VUs, 3934 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  1m31.0s/2m0s

running (1m32.0s), 50/50 VUs, 3980 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  1m32.0s/2m0s

running (1m33.0s), 50/50 VUs, 4022 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  1m33.0s/2m0s

running (1m34.0s), 50/50 VUs, 4064 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  1m34.0s/2m0s

running (1m35.0s), 50/50 VUs, 4108 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  1m35.0s/2m0s

running (1m36.0s), 50/50 VUs, 4154 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  1m36.0s/2m0s

running (1m37.0s), 50/50 VUs, 4200 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  1m37.0s/2m0s

running (1m38.0s), 50/50 VUs, 4242 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  1m38.0s/2m0s

running (1m39.0s), 50/50 VUs, 4285 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  1m39.0s/2m0s

running (1m40.0s), 50/50 VUs, 4330 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  1m40.0s/2m0s

running (1m41.0s), 50/50 VUs, 4376 complete and 0 interrupted iterations
default   [  84% ] 50 VUs  1m41.0s/2m0s

running (1m42.0s), 50/50 VUs, 4418 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  1m42.0s/2m0s

running (1m43.0s), 50/50 VUs, 4468 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  1m43.0s/2m0s

running (1m44.0s), 50/50 VUs, 4508 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  1m44.0s/2m0s

running (1m45.0s), 50/50 VUs, 4550 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  1m45.0s/2m0s

running (1m46.0s), 50/50 VUs, 4592 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  1m46.0s/2m0s

running (1m47.0s), 50/50 VUs, 4634 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  1m47.0s/2m0s

running (1m48.0s), 50/50 VUs, 4676 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  1m48.0s/2m0s

running (1m49.0s), 50/50 VUs, 4718 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  1m49.0s/2m0s

running (1m50.0s), 50/50 VUs, 4768 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  1m50.0s/2m0s

running (1m51.0s), 50/50 VUs, 4808 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  1m51.0s/2m0s

running (1m52.0s), 50/50 VUs, 4850 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  1m52.0s/2m0s

running (1m53.0s), 50/50 VUs, 4892 complete and 0 interrupted iterations
default   [  94% ] 50 VUs  1m53.0s/2m0s

running (1m54.0s), 50/50 VUs, 4934 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  1m54.0s/2m0s

running (1m55.0s), 50/50 VUs, 4976 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  1m55.0s/2m0s

running (1m56.0s), 50/50 VUs, 5018 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  1m56.0s/2m0s

running (1m57.0s), 50/50 VUs, 5068 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  1m57.0s/2m0s

running (1m58.0s), 50/50 VUs, 5112 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  1m58.0s/2m0s

running (1m59.0s), 50/50 VUs, 5154 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  1m59.0s/2m0s

running (2m00.0s), 50/50 VUs, 5196 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  2m00.0s/2m0s

running (2m01.0s), 09/50 VUs, 5237 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  2m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=37.04ms med=12.33ms min=759.3µs max=1.17s p(90)=117.23ms p(95)=139.27ms p(99)=165.68ms
      { expected_response:true }...: avg=37.04ms med=12.33ms min=759.3µs max=1.17s p(90)=117.23ms p(95)=139.27ms p(99)=165.68ms
    http_req_failed................: 0.00%  0 out of 20984
    http_reqs......................: 20984  173.22258/s

    EXECUTION
    iteration_duration.............: avg=1.14s   med=1.13s   min=1.1s    max=2.21s p(90)=1.18s    p(95)=1.2s     p(99)=1.32s   
    iterations.....................: 5246   43.305645/s
    vus............................: 9      min=9          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 44 MB  364 kB/s
    data_sent......................: 7.7 MB 63 kB/s



running (2m01.1s), 00/50 VUs, 5246 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  2m0s